

Процедура ОткрытьФормуЗвонковПоОбъекту(Объект) Экспорт	
	Парам = Новый Структура; 
    Отбор = Новый Структура; 
    Отбор.Вставить("Объект", Объект); 
	Парам.Вставить("Отбор", Отбор); 
     
    ОткрытьФорму("РегистрСведений.ВАТСЗвонкиПоОбъекту.ФормаСписка", Парам);	
КонецПроцедуры

Процедура ПозвонитьКонтрагенту(Контрагент, Форма, ОткрыватьНовоеСобытие = Истина, ЭлементФормы = Неопределено) Экспорт
	
	СписокНомеров = ВАТССервер.ПолучитьСписокНомеровКонтрагента(Контрагент);	
	Если СписокНомеров.Количество() = 0 Тогда
		Сообщить("Не удалось найти телефонные номера для клиента "+Контрагент);
		Возврат;		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Контрагент",Контрагент);
	ДополнительныеПараметры.Вставить("ОткрыватьНовоеСобытие",ОткрыватьНовоеСобытие);
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораНомера", ВАТСКлиент, ДополнительныеПараметры);
	Форма.ПоказатьВыборИзСписка(Оп, СписокНомеров, ЭлементФормы);     
				
КонецПроцедуры

Процедура ВыполнитьПослеВыбораНомера(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ВыбНомер = ВыбранныйЭлемент.Значение[0];
	//Контакт  = ВыбранныйЭлемент.Значение[1];	
	ВАТССервер.Позвонить(ВыбранныйЭлемент.Значение[0]);
		
КонецПроцедуры

