
&НаКлиенте
Процедура МобилонПоказатьЗвонкиПосле(Команда)
	
	ЗначениеОтбора  = Новый Структура("Объект", Объект.Ссылка);//ВАТССервер.ВернутьКонтрагентаПартнера(Объект.Ссылка)
	ПараметрыОтбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ВАТСжурналЗвонков.Форма.ФормаСписка", ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура МобилонПозвонитьМобилонПосле(Команда)
	
	ВАТСКлиент.ПозвонитьКонтрагенту(Объект.Ссылка, ЭтаФорма, ,Элементы.ФормаПозвонитьМобилон);	
	
КонецПроцедуры
