
&НаКлиенте
Процедура ПрослушатьЗапись(Команда)
	
	recordUrl = Элементы.Список.ТекущиеДанные.recordUrl;		
	Если ЗначениеЗаполнено(recordUrl) Тогда
		ЗапуститьПриложение(recordUrl);
	Иначе
		ПоказатьОповещениеПользователя("Не указан путь к записи.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	
	Если (Элементы.Список.ТекущийЭлемент.Имя = "ЗаписьРазговора" ИЛИ Элементы.Список.ТекущийЭлемент.Имя = "recordUrl")
		И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.recordUrl) Тогда
		ЗапуститьПриложение(Элементы.Список.ТекущиеДанные.recordUrl);
		Возврат;
	КонецЕсли;
		
	Если Элементы.Список.ТекущийЭлемент.Имя = "Документ" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Документ) Тогда
		ПоказатьЗначение( ,Элементы.Список.ТекущиеДанные.Документ);
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "Комментарий" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Документ) Тогда
		// Открываем на вкладке Комментарий
		Форма = ПолучитьФорму("Документ.ТелефонныйЗвонок.Форма.ФормаДокумента");
		Форма.Открыть();
		Форма.Элементы.СтраницыОписаниеДополнительно.ТекущаяСтраница = Форма.Элементы.СтраницаКомментарий;
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "Позвонить" Тогда
		ВАТСКлиент.ПозвонитьКонтрагенту(Элементы.Список.ТекущиеДанные.Объект, ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Объект) Тогда			
		ПоказатьЗначение(, Элементы.Список.ТекущиеДанные.Объект); 	
	Иначе
		Форма = ПолучитьФорму("Справочник.Партнеры.Форма.ПомощникНового");
		Форма.ТелефонПартнера = Элементы.Список.ТекущиеДанные.СНомера;
		Форма.Открыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьМобилон(Команда)
	
	ВАТСКлиент.ПозвонитьКонтрагенту(Элементы.Список.ТекущиеДанные.Объект, ЭтаФорма);

КонецПроцедуры
