
&НаКлиенте
Процедура ПрослушатьЗапись(Команда)
	
	recordUrl = Элементы.Список.ТекущиеДанные.recordUrl;		
	Если ЗначениеЗаполнено(recordUrl) Тогда
		ЗапуститьПриложение(recordUrl);
	Иначе
		ПоказатьОповещениеПользователя("Не указан путь к записи.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "КартинкаОбъект" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Объект) Тогда
		ПоказатьЗначение(,Элементы.Список.ТекущиеДанные.Объект);
		Отказ = Истина;
	КонецЕсли;
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "ЗаписьРазговора" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.recordUrl) Тогда
		ЗапуститьПриложение(Элементы.Список.ТекущиеДанные.recordUrl);
		Отказ = Истина;
	КонецЕсли;
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "recordUrl" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.recordUrl) Тогда
		ЗапуститьПриложение(Элементы.Список.ТекущиеДанные.recordUrl);
		Отказ = Истина;
	КонецЕсли;
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "Объект" Тогда
		Отказ = Истина;
		Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Объект) Тогда			
			ПоказатьЗначение(, Элементы.Список.ТекущиеДанные.Объект); 	
		Иначе
			Форма = ПолучитьФорму("Справочник.Партнеры.Форма.ПомощникНового");
			Форма.ТелефонПартнера = Элементы.Список.ТекущиеДанные.СНомера;
			Форма.Открыть();
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры
