
&НаКлиенте
Процедура ПрослушатьЗапись(Команда)
	recordUrl = Элементы.Список.ТекущиеДанные.recordUrl;		
	Если ЗначениеЗаполнено(recordUrl) Тогда
		ЗапуститьПриложение(recordUrl);
	Иначе
		ПоказатьОповещениеПользователя("Не указан путь к записи.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.Список.ТекущийЭлемент.Имя="КартинкаОбъект" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Объект) Тогда
		ПоказатьЗначение(,Элементы.Список.ТекущиеДанные.Объект);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
