
#Область ПрограммныйИнтерфейс

Функция НайтиЗвонокПоИдентификатору(uuid) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВАТСжурналЗвонков.uuid КАК uuid,
		|	ВАТСжурналЗвонков.Объект КАК Объект,
		|	ВАТСжурналЗвонков.ДатаЗвонка КАК ДатаЗвонка,
		|	ВАТСжурналЗвонков.СНомера КАК СНомера,
		|	ВАТСжурналЗвонков.callstatus КАК callstatus,
		|	ВАТСжурналЗвонков.НаНомер КАК НаНомер,
		|	ВАТСжурналЗвонков.Пользователь КАК Пользователь,
		|	ВАТСжурналЗвонков.direction КАК direction,
		|	ВАТСжурналЗвонков.recordUrl КАК recordUrl,
		|	ВАТСжурналЗвонков.state КАК state,
		|	ВАТСжурналЗвонков.time КАК time,
		|	ВАТСжурналЗвонков.userkey КАК userkey
		|ИЗ
		|	РегистрСведений.ВАТСжурналЗвонков КАК ВАТСжурналЗвонков
		|ГДЕ
		|	ВАТСжурналЗвонков.uuid = &uuid";
	
	Запрос.УстановитьПараметр("uuid", uuid);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
		
	Ответ = Новый Структура;
	Для Каждого Эл Из РезультатЗапроса.Колонки Цикл
		Ответ.Вставить(Эл.Имя);
	КонецЦикла;
		
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ,Выборка);	
	Иначе
		Ответ = Неопределено
	КонецЕсли;	
	Возврат Ответ;	
	
КонецФункции

Процедура ЗарегистрироватьИлиОбновитьЗвонок(МенеджерЗаписи,Данные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Данные);
	МенеджерЗаписи.Записать();	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

Процедура ЗарегистрироватьИсходящийЗвонок(Пользователь, Объект, НаНомер, uuid, recordUrl) Экспорт

	МенеджерЗаписи				= РегистрыСведений.ВАТСжурналЗвонков.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.ДатаЗвонка	= ТекущаяДата();
	МенеджерЗаписи.Объект		= Объект;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.НаНомер		= НаНомер;
	МенеджерЗаписи.direction	= "external";
	МенеджерЗаписи.uuid			= uuid;
	МенеджерЗаписи.recordUrl	= recordUrl;
	МенеджерЗаписи.Записать();

КонецПроцедуры



#КонецОбласти