
#Область ПрограммныйИнтерфейс

Функция НайтиЗвонокПоИдентификатору(uuid) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВАТСЗвонкиПоОбъекту.uuid КАК uuid,
		|	ВАТСЗвонкиПоОбъекту.Объект КАК Объект,
		|	ВАТСЗвонкиПоОбъекту.ДатаЗвонка КАК ДатаЗвонка,
		|	ВАТСЗвонкиПоОбъекту.СНомера КАК СНомера,
		|	ВАТСЗвонкиПоОбъекту.callstatus КАК callstatus,
		|	ВАТСЗвонкиПоОбъекту.НаНомер КАК НаНомер,
		|	ВАТСЗвонкиПоОбъекту.Пользователь КАК Пользователь,
		|	ВАТСЗвонкиПоОбъекту.direction КАК direction,
		|	ВАТСЗвонкиПоОбъекту.recordUrl КАК recordUrl,
		|	ВАТСЗвонкиПоОбъекту.state КАК state,
		|	ВАТСЗвонкиПоОбъекту.time КАК time,
		|	ВАТСЗвонкиПоОбъекту.userkey КАК userkey
		|ИЗ
		|	РегистрСведений.ВАТСЗвонкиПоОбъекту КАК ВАТСЗвонкиПоОбъекту
		|ГДЕ
		|	ВАТСЗвонкиПоОбъекту.uuid = &uuid";
	
	Запрос.УстановитьПараметр("uuid", uuid);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
		
	Ответ = Новый Структура;
	Для Каждого Эл Из РезультатЗапроса.Колонки Цикл
		Ответ.Вставить(Эл.Имя);
	КонецЦикла;
		
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ,Выборка);	
	Иначе
		Ответ = Неопределено
	КонецЕсли;	
	Возврат Ответ;
	
КонецФункции

Процедура ЗарегистрироватьИлиОбновитьЗвонок(МенеджерЗаписи,Данные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Данные);
	МенеджерЗаписи.СНомера		= Данные.from;
	МенеджерЗаписи.НаНомер		= Данные.to;
	МенеджерЗаписи.Записать();	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


#КонецОбласти