
Процедура ПоказатьФормуВходящегоЗвонка() Экспорт
	МассивДанных = ВАТССервер.ПолучитьОповещенияПользователя();
	
	стр = "";
	Для каждого текЭл Из МассивДанных Цикл	
		НеПоказыватьБольшуюФормуПриВходящемЗвонке = ОбщегоНазначения.ПолучитьЗначениеРеквизитаТекущегоПользователя("НеПоказыватьБольшуюФормуПриВходящемЗвонке");
		ФормаЗвонка = ПолучитьФорму("Обработка.ВходящийЗвонок.Форма.Форма");
		ДанныеФормы = ФормаЗвонка.Объект; 
		ДанныеФормы.СНомера = текЭл.numFrom;
		ФормаЗвонка.Открыть();	
		Если НеПоказыватьБольшуюФормуПриВходящемЗвонке Тогда
			Попытка
				ФормаЗвонка.Закрыть();
			Исключение
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;		
КонецПроцедуры
