
&НаКлиенте
Процедура МобилонСоздатьЗаказКлиентаПосле(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Заказ = ВАТССервер.СоздатьЗаказКлиентаНаОснованииТелефонногоЗвонка(Объект.Ссылка);
		ПоказатьЗначение(, Заказ);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сперва нужно записать документ.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиЗаписьВЖурналеЗвонков()
	Результат = ВАТССервер.НайтиЗаписьВЖурналеЗвонков("Документ", Объект.Ссылка);	
	Возврат ?(Результат = Неопределено, Неопределено, Результат.recordUrl)
КонецФункции // ()


&НаКлиенте
Процедура МобилонПрослушатьПосле(Команда)
	recordUrl = НайтиЗаписьВЖурналеЗвонков();	
	Если ЗначениеЗаполнено(recordUrl) Тогда
		ЗапуститьПриложение(recordUrl);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запись звонка не найдена");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МобилонПозвонитьМобилонПосле(Команда)
	
	ВАТСКлиент.ПозвонитьКонтрагенту(Объект.АбонентКонтакт, ЭтаФорма, ,Элементы.ФормаПозвонитьМобилон);
	
КонецПроцедуры
