
&После("ПриНачалеРаботыСистемы")
Процедура МобилонПриНачалеРаботыСистемы()
	
	ТекущийПользователь = ВАТССервер.ВернутьТекущегоПользователя();
	ПоказыватьВсплывающиеУведомленияПриЗвонках = ВАТССервер.ПолучитьЗначениеПараметра(ТекущийПользователь, "ПоказыватьВсплывающиеУведомленияПриЗвонках");
	ПоказыватьРасширеннуюИнформациюПриЗвонках = ВАТССервер.ПолучитьЗначениеПараметра(ТекущийПользователь, "ПоказыватьРасширеннуюИнформациюПриЗвонках");
	Если ПоказыватьВсплывающиеУведомленияПриЗвонках ИЛИ ПоказыватьРасширеннуюИнформациюПриЗвонках Тогда
		ПодключитьОбработчикОжидания("ПоказатьФормуВходящегоЗвонка",5);	
	КонецЕсли;
	
КонецПроцедуры
