
Функция ПолучитьЗначениеПараметра(Пользователь, НаваниеПараметра) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВАТСДополнительныеПараметрыПользователей.ВнутреннийНомер КАК Параметр
		|ИЗ
		|	РегистрСведений.ВАТСДополнительныеПараметрыПользователей КАК ВАТСДополнительныеПараметрыПользователей
		|ГДЕ
		|	ВАТСДополнительныеПараметрыПользователей.Пользователь = &Пользователь";
	
	Если НаваниеПараметра <> "ВнутреннийНомер" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВнутреннийНомер",	НаваниеПараметра);	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Параметр;	
	КонецЦикла;
	Возврат Неопределено;

КонецФункции // ПолучитьЗначениеПараметра()

Функция НайтиПользователя(ВнутреннийНомер) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВАТСДополнительныеПараметрыПользователей.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ВАТСДополнительныеПараметрыПользователей КАК ВАТСДополнительныеПараметрыПользователей
		|ГДЕ
		|	ВАТСДополнительныеПараметрыПользователей.ВнутреннийНомер = &ВнутреннийНомер";
	
	Попытка	
		Номер = Число(ВнутреннийНомер);
	Исключение
		Возврат Неопределено;	
	КонецПопытки;
	
	Запрос.УстановитьПараметр("ВнутреннийНомер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Пользователь;
	КонецЦикла;
	Возврат Неопределено;

КонецФункции // ()

