
Процедура ЗарегистрироватьСобытие(Данные, Метод) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Данные);
	РаспарсенныеДанные = ПрочитатьJSON(Чтение, Ложь);
	Чтение.Закрыть();
	
	УстановитьПривилегированныйРежим(Истина); 
	МенеджерЗаписи					= РегистрыСведений.ВАТСЛогиЗапросов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РаспарсенныеДанные);
		
	МенеджерЗаписи.Идентификатор	= Новый УникальныйИдентификатор;
	МенеджерЗаписи.Дата				= ТекущаяДата();
	МенеджерЗаписи.Данные			= Данные;
	МенеджерЗаписи.Метод			= Метод;
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
