

&НаКлиенте
Процедура ВыполнитьПоиск()
				
	Объект.Контрагент = ВАТССервер.НайтиОбъектПоНомеруТелефона(Объект.СНомера).Партнер;
		
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Контр		= Символы.ПС + Символы.ПС + "Контрагент:" + Объект.Контрагент;		
		НавСсылка	= ПолучитьНавигационнуюСсылку(Объект.Контрагент);
	Иначе
		Контр		= "";
		НавСсылка	= Неопределено;
	КонецЕсли;		
	ПоказатьОповещениеПользователя("Входящий", НавСсылка, "От " + Объект.СНомера + Контр, ,СтатусОповещенияПользователя.Важное);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.СНомера) Тогда
		ВыполнитьПоиск();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Контрагент(Команда)
	
	ОткрытьЗначение(Объект.Контрагент);
	
КонецПроцедуры





