

&НаКлиенте
Процедура ВыполнитьПоиск()
				
	Объект.Контрагент = ВАТССервер.НайтиОбъектПоНомеруТелефона(Объект.СНомера).Партнер;
	Элементы.КнопкаКонтрагент.Заголовок = Объект.Контрагент;
		
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Контр		= Символы.ПС + Символы.ПС + "Контрагент:" + Объект.Контрагент;		
		НавСсылка	= ПолучитьНавигационнуюСсылку(Объект.Контрагент);
	Иначе
		Контр		= "";
		НавСсылка	= Неопределено;
	КонецЕсли;
	Если ВАТССервер.ПолучитьЗначениеПараметра(ВАТССервер.ВернутьТекущегоПользователя(), "ПоказыватьВсплывающиеУведомленияПриЗвонках") Тогда
		ПоказатьОповещениеПользователя("Входящий", НавСсылка, "От " + Объект.СНомера + Контр, ,СтатусОповещенияПользователя.Важное);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.СНомера) Тогда
		ВыполнитьПоиск();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьЗначениеПолей(СНомера)
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СНомера, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));	
	
КонецФункции


&НаКлиенте
Процедура Контрагент(Команда)
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОткрытьЗначение(Объект.Контрагент);
	Иначе 
		Форма = ПолучитьФорму("Справочник.Партнеры.Форма.ПомощникНового");
		Форма.ТелефонПартнера = Объект.СНомера;
		Форма.ТелефонПартнераЗначенияПолей = ВернутьЗначениеПолей(Объект.СНомера);
		Форма.Открыть();		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьМобилон(Команда)
	
	ВАТССервер.Позвонить(Объект.СНомера);
	
КонецПроцедуры





