
&НаСервере
Процедура ПолучитьДанныеИзCRM(СНомера,Текст)
	
	//Если НЕ ПараметрыСеанса.ТекущийПользователь.ПолучатьДанныеИзCRMПриВходящемЗвонке Тогда
	//	Элементы.ГруппаДанныеCRM.Видимость=Ложь;
	//	Возврат;
	//КонецЕсли;
	
	Данные = Неопределено;
	
	СтрокаПодключения = Константы.СтрокаПодключенияCRM.Получить();//"File=""D:\db82\CRM\CRM_developer"";Usr=""Администратор"";";
	
	
	КоннекторСоздан = Ложь;
	
	//Попытка
	Connector= Новый COMОбъект("V83.COMConnector");
	//Исключение
	//Connector= Новый COMОбъект("V82.COMConnector");
	//КонецПопытки;
	
	Попытка
		База = Connector.Connect(СтрокаПодключения);
	Исключение
		Сообщить("Ошибка подключения!");
		Возврат;
	КонецПопытки;

	Данные = База.ОбщегоНазначенияCOM.НайтиКонтрагентаПоНомеруТелефонаCOM(СНомера);	
	
	ТекстCRM = "";
	Если Данные<>Неопределено Тогда
		Элементы.ГруппаДанныеCRM.Видимость=Истина;
		ТекстCRM= 
		Символы.ПС+"Наименование:"+Данные.КонтрагентНаименование
		+Символы.ПС+"Куратор:"+Данные.КураторНаименование
		+Символы.ПС+"Дата отношения:"+Данные.ДатаОтношения
		+Символы.ПС+"Автор отношения:"+Данные.АвторНаименование;
		Текст=Текст+Символы.ПС+ТекстCRM;	
	Иначе
		Элементы.ГруппаДанныеCRM.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОбработку()
	Возврат Обработки._ВходящийЗвонок.ПолучитьФорму("Форма");
КонецФункции

&НаКлиенте
Процедура ВыполнитьПоиск()
	СНомера = Объект.СНомера;
	Наименование = "";
	ОткрытаяЗадача = Неопределено;
	
	Если Лев(СНомера,4)="8391" Тогда
		СНомера = Сред(СНомера,5);
	КонецЕсли;
	
	// 09.11.2018  Мобилон Начало блока
	КонтЛицо = "";
	// 09.11.2018  Мобилон Конец блока
	Если СтрДлина(СНомера)<=3 Тогда
		// поиск по внутренним номерам сотрудников
		Объект.Контрагент = ОбщегоНазначения.НайтиСотрудникаНоНомеруТелефона(СНомера);
	Иначе
		Объект.Контрагент = ОбщегоНазначения.НайтиКонтрагентаПоНомеруТелефона(СНомера,,КонтЛицо);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Элементы.КнопкаКонтрагент.Видимость	= Истина;
		КтоЗвонит							= ОбщегоНазначения.ПолучитьЗначениеРеквизитаОбъекта(Объект.Контрагент,"Наименование");
		Элементы.КнопкаКонтрагент.Заголовок	= КтоЗвонит;	
		Если ТипЗнч(Объект.Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
			ОткрытаяЗадача	= ПолучитьОткрытуюЗадачу(Объект.Контрагент);
			Куратор			= ОбщегоНазначения.ПолучитьЗначениеРеквизитаОбъекта(Объект.Контрагент,"Куратор");
		КонецЕсли;	
	Иначе
		Элементы.КтоЗвонит.Видимость		= Ложь;
		Элементы.КнопкаКонтрагент.Видимость	= Ложь;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Контр		= Символы.ПС+Символы.ПС+"Контрагент:"+Объект.Контрагент;		
		НавСсылка	= ПолучитьНавигационнуюСсылку(Объект.Контрагент);
	Иначе
		Контр		= "";
		НавСсылка	= Неопределено;
	КонецЕсли;	
	
	//НавСсылка = "e1cib/app/Обработка._ВходящийЗвонок";	
	Текст = "От "+Объект.СНомера+Контр + ?(ЗначениеЗаполнено(КонтЛицо), Символы.ПС + КонтЛицо, "");
	
	ПолучатьДанныеИзCRMПриВходящемЗвонке = ОбщегоНазначения.ПолучитьЗначениеРеквизитаТекущегоПользователя("ПолучатьДанныеИзCRMПриВходящемЗвонке");
	//Если ПолучатьДанныеИзCRMПриВходящемЗвонке И СтрДлина(СНомера)>6 Тогда
	//	ПолучитьДанныеИзCRM(СНомера,Текст);	
	//КонецЕсли;
	
	УправлениеФормой();
	
	ПоказатьОповещениеПользователя("Входящий",НавСсылка,Текст,БиблиотекаКартинок.УслугиСвязи,СтатусОповещенияПользователя.Важное);
	Если НЕ ПолучатьДанныеИзCRMПриВходящемЗвонке Тогда
		ЭтаФорма.Закрыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаДанныеCRM.Видимость=Ложь;
	
	Если ЗначениеЗаполнено(Объект.СНомера) Тогда
		ВыполнитьПоиск();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаНомерПриИзменении(Элемент)
	ВыполнитьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлиента(Команда)
	ОткрытьЗначение(Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура Контрагент(Команда)
	ОткрытьЗначение(Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеИзCRM1(Команда)
	Элементы.ГруппаДанныеCRM.Видимость=Ложь;
	
	Текст = "С номера:"+Объект.СНомера;//+Контр;
	ПолучитьДанныеИзCRM(Объект.СНомера,Текст);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОткрытуюЗадачу(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияЗадачСрезПоследних.Задача.Контрагент,
		|	СостоянияЗадачСрезПоследних.Задача,
		|	СостоянияЗадачСрезПоследних.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияЗадач.СрезПоследних КАК СостоянияЗадачСрезПоследних
		|ГДЕ
		|	(СостоянияЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадачи.ВРаботе)
		|			ИЛИ СостоянияЗадачСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадачи.Поступление))
		|	И СостоянияЗадачСрезПоследних.Задача.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостоянияЗадачСрезПоследних.Задача.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Задача;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура УправлениеФормой()
	Элементы.ОткрытаяЗадача.Видимость = ЗначениеЗаполнено(ОткрытаяЗадача);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоследнийАктПоПочте(Команда)
	
	Контрагент = Объект.Контрагент;
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Акт = ВернутьПоследнийАкт(Контрагент);
	Если Акт=Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден акт для отправки.");
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;	
	ПечатьДокументов.ПечатьАктаИСчетаФактурыНаОдномЛисте(ТабДок,Акт,Истина,Ответственный);	
	//РаспечататьСФСервер(ТабДок,сПечатью);
	
	Форма						= ПолучитьФорму("Обработка.ВыводПечатнойФормы.Форма",,,Истина);
	Форма.ТабДок				= ТабДок;
	Форма.Контрагент			= Объект.Контрагент; 
	Форма.Документ				= Акт;
	Форма.ХочуОтправитьПоПочте	= Истина;
	Форма.Объект.Получатели		= ОбщегоНазначения.ПолучитьЗначениеРеквизитаОбъекта(Объект.Контрагент,"АдресДоставкиСчетов");
	Форма.Объект.Тема			= "Счет-фактура, ООО ""Мобилон Телекоммуникации""";
	Форма.Объект.Текст			= "
		|Во вложенном файле счет-фактура ООО ""Мобилон Телекоммуникации"" на услуги связи (Выгодный межгород)
		|
		|С уважением,
		|отдел обслуживания
		|компании Мобилон
		|телефон/факс: (391) 274-50-00
		|
		|Данное сообщение содержит конфиденциальную информацию, доступ к которой ограничен действующим законодательством. Несанкционированное раскрытие, использование, распространение содержащейся в нем информации представляет собой правонарушение и влечет за собой ответственность, установленную законодательством Российской Федерации. Если Вы не являетесь лицом, которому это сообщение было адресовано, рекомендуем Вам немедленно информировать об этом отправителя и удалить полученное сообщение.
		|";
	Форма.Открыть()
	
	
	////Парам = Новый Структура;
	//Оповещение	= Новый ОписаниеОповещения("ПослеВводаАдреса",ЭтаФорма);
	//ПоказатьВводСтроки(Оповещение,Адреса,"Введите адрес");	
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПослеВводаАдреса(Строка, Параметры) Экспорт	
//    Если НЕ Строка = Неопределено Тогда
//        Сообщить("Вы ввели "+Строка);
//    КонецЕсли;
//КонецПроцедуры;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ответственный = ОбщегоНазначения.ПолучитьТекущегоПользователя();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьПоследнийАкт(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОказаниеУслуг.Ссылка
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОказаниеУслуг.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции



