
Функция ПолучитьЗначение(Код) Экспорт 

	Возврат Справочники.ВАТСКонстанты.НайтиПоКоду(Код).Значение; 		

КонецФункции


Процедура СоздатьПредопределенныеЭлементы() Экспорт 
	Наим = "API-токен ВАТС"; 
	Код = "APIтокен";
	Если Справочники.ВАТСКонстанты.НайтиПоКоду(Код) = Справочники.ВАТСКонстанты.ПустаяСсылка() Тогда
		НовыйЭлемент = Справочники.ВАТСКонстанты.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наим;
		НовыйЭлемент.Код = Код;
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Наим = "Ответственный за пропущенный"; 
	Код = "ОтветственныйЗаПропущенный";
	Если Справочники.ВАТСКонстанты.НайтиПоКоду(Код) = Справочники.ВАТСКонстанты.ПустаяСсылка() Тогда
		НовыйЭлемент = Справочники.ВАТСКонстанты.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наим;
		НовыйЭлемент.Код = Код;
		НовыйЭлемент.Значение = Перечисления.МобилонОтветственныйЗаПропущенный.Последний;
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Наим = "Вариант отображения информации о входящем"; 
	Код = "ВариантОтображенияИнформацииОВходящем";
	Если Справочники.ВАТСКонстанты.НайтиПоКоду(Код) = Справочники.ВАТСКонстанты.ПустаяСсылка() Тогда
		НовыйЭлемент = Справочники.ВАТСКонстанты.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наим;
		НовыйЭлемент.Код = Код;
		НовыйЭлемент.Значение = Перечисления.МобилонВариантыОтображенияИнформацииОВходящем.Форма;
		НовыйЭлемент.Записать();
	КонецЕсли;

	
КонецПроцедуры
